@vgn-tl can you confirm that you consistently get this error? I've tried to reproduce the issue on my side with your exact configuration, and it works:

```console
$ cat test.tf
terraform {
  required_providers {
    exoscale = {
      source  = "exoscale/exoscale"
      version = "0.29.0"
    }
  }
}

locals {
  zone = "ch-gva-2"
}

resource "exoscale_database" "prod" {
  zone = local.zone
  name = "prod"
  type = "pg"
  plan = "startup-4"

  maintenance_dow  = "sunday"
  maintenance_time = "23:00:00"

  termination_protection = true

  user_config = jsonencode({
    pg_version    = "13"
    backup_hour   = 1
    backup_minute = 0
    ip_filter     = ["194.182.161.182/32"]
    pglookout = {
      max_failover_replication_time_lag = 60
    }
  })
}

output "database_uri" {
  value     = exoscale_database.prod.uri
  sensitive = true # added to avoid terraform error
}

########################

$ terraform apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the
following symbols:
  + create

Terraform will perform the following actions:

  # exoscale_database.prod will be created
  + resource "exoscale_database" "prod" {
      + created_at             = (known after apply)
      + disk_size              = (known after apply)
      + features               = (known after apply)
      + id                     = (known after apply)
      + maintenance_dow        = "sunday"
      + maintenance_time       = "23:00:00"
      + metadata               = (known after apply)
      + name                   = "prod"
      + node_cpus              = (known after apply)
      + node_memory            = (known after apply)
      + nodes                  = (known after apply)
      + plan                   = "startup-4"
      + state                  = (known after apply)
      + termination_protection = true
      + type                   = "pg"
      + updated_at             = (known after apply)
      + uri                    = (sensitive value)
      + user_config            = jsonencode(
            {
              + backup_hour   = 1
              + backup_minute = 0
              + ip_filter     = [
                  + "194.182.161.182/32",
                ]
              + pg_version    = "13"
              + pglookout     = {
                  + max_failover_replication_time_lag = 60
                }
            }
        )
      + zone                   = "ch-gva-2"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + database_uri = (sensitive value)

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

exoscale_database.prod: Creating...
exoscale_database.prod: Still creating... [10s elapsed]
exoscale_database.prod: Creation complete after 11s [id=prod]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

Outputs:

database_uri = <sensitive>

$ terraform plan
exoscale_database.prod: Refreshing state... [id=prod]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration and found no differences, so no changes are needed.
```